YaswanthReddy06/stm32-embedded-systems-projects/Module5_I2C_TempSensorDriver/Core/Src/main.c
	//Configure the Speed Register
	// 11: Very High Speed
	// OSPEEDR Bit 29 and Bit 28

	 //RESET both bits 29 and 28 to 0
		 GPIOB->OSPEEDR &= ~ (0x3 << 28);
		//SET the values
		 GPIOB->OSPEEDR |= (0x3 << 28);

}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  //activate the message transmission once a button is pushed
	//xTaskNotifyFromISR( xTaskToNotify, ulValue, eAction, pxHigherPriorityTaskWoken)
 xTaskNotifyFromISR(pUART_SendMSG, 0, eNoAction,NULL );

}

static void SOS_Transmit(void * parameter)
{
    repeat = 2;
	while (1)
		  {
			  //activated when the user enters the number of repeats

			  //for (int j=0; j<3; j++)
		     // while (repeat > 0)
		while (1)
			  {
				  //transmits SOS three times



		//Sending 'S'
		  for(int i=0; i<3; i++)
		  {
		//light up the LED for a DOT
			  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
			  GPIOB->ODR |= (1 << 14);

		// HAL_Delay(300);
		vTaskDelay( 300);

		//turn off the LED for spacing
		// HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
		  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		 GPIOB->ODR &= ~ (1 << 14);

		//HAL_Delay(300);
		 vTaskDelay( 300);
		  }
		  //three times units between characters (two additional units)
		  //HAL_Delay(300 *2);
		  vTaskDelay( 300 *2);

		  //Sending 'O'
		  for(int i=0; i<3; i++)
		  {
			  //light up the LED for a Dash
			 // HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_SET);
			  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
		  				  GPIOB->ODR |= (1 << 14);

			 // HAL_Delay(300 *3);
		  		vTaskDelay( 300 *3);
			  //turn off the LED for spacing
			  //HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
			  //Write a 0 to Bit 14 of GPIOB ODR (Output Data Register)
			 	  			 GPIOB->ODR &= ~ (1 << 14);
			  //HAL_Delay(300);
			  vTaskDelay( 300);
		  }
		  //three times units between characters(two additional units)
		  //HAL_Delay(300 *2);
		  vTaskDelay( 300 *2);

		  //Sending 'S'
		  	  for(int i=0; i<3; i++)
		  	  {
		  		//light up the LED for a DOT
		  				  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
		  				  GPIOB->ODR |= (1 << 14);

		  			 //HAL_Delay(300);
		  			   vTaskDelay(300);
		  			//turn off the LED for spacing
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
		  			  //Write a 0 to Bit 14 of GPIOB ODR (Output Data Register)
		  			 GPIOB->ODR &= ~ (1 << 14);

		  			//HAL_Delay(300);
		  			vTaskDelay( 300);
		  	  }
		  	  //Seven times units between words (six additional units)
		  	  //HAL_Delay(300 *6);
		  	vTaskDelay( 300 *6);

		  	repeat--;

		}
			  //SOS_transmission = 0;

		      xQueueReceive(pUARTQueue, &cmd, portMAX_DELAY);

		      if (cmd -'0' >=1 && cmd -'0' <=3)
		      {
		    	repeat = cmd - '0';
		      }
		      else
		      {
		    	  repeat = 0;
		      }
		  }


}

static void UART_SendMSG(void * parameter)
{

	while (1)
	{

	 HAL_UART_Transmit(&huart1, parameter, strlen(parameter), 1000);
	 //wait for button push to reprint
	 xTaskNotifyWait(0, 0, NULL,portMAX_DELAY);

	}

}



static void MyTSENSOR_init()
{

	uint8_t tmp;
	//READ CTRL_REG1 (0X20)
	//Device address: 0xBF
	//HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0X20, 0X1U, &tmp, 1, 1000);

	//Configure BDU: 1
	//BDU:Bit2
	tmp |=(1<< 0x02);


	//Set ODR to 1 Hz
	//ODR: 01
	//ODR: Bit 1 and 0

	tmp &= ~ 0x03;
	tmp |= (1 << 0x00);


	//Activate the device PD: 1
	//PD: Bit 7
	tmp |= (1 << 0x7);


	//WRITE CTRL_REG1 (0X20)
	//Device address: 0xBE
	//HAL_I2C_Mem_Write(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	HAL_I2C_Mem_Write(&hi2c2, 0xBE, 0X20, 0X1U, &tmp, 1, 1000);



}

static void TempSensorRead(void * parameter)
{
	char tempReading[100];
	float tempvalue =0;
	while (1)
	{
		//tempvalue = BSP_TSENSOR_ReadTemp();
		tempvalue = MyTSENSOR_ReadTemp();

        int tempValueInt = tempvalue;
        float tempvalueFrac =0;

        tempvalueFrac = tempvalue - tempValueInt;

        int tempValueFrac2digits = trunc(tempvalueFrac * 100);

        snprintf(tempReading, 100, "\r\n TEMPERATURE = %1d.%02d\r\n", tempValueInt, tempValueFrac2digits);

        HAL_UART_Transmit(&huart1, (uint8_t *) tempReading, strlen(tempReading), 1000);

		vTaskDelay(5000);

	}
}

static float MyTSENSOR_ReadTemp()
{

	int16_t T0_out, T1_out, T_out, T0_degC_x8_u16, T1_degC_x8_u16;
	  int16_t T0_degC, T1_degC;
	  uint8_t buffer[4], tmp;
	  float tmp_f;


	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_T0_DEGC_X8 | 0x80), buffer, 2);
	 // HTS221_T0_DEGC_X8: Address 0x32
	 //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	  	HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0X32 | 0x80, 0X1U, buffer, 2, 1000);


	  //tmp = SENSOR_IO_Read(DeviceAddr, HTS221_T0_T1_DEGC_H2);
	  //HTS221_T0_T1_DEGC_H2: Address 0x35
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	  HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0X35, 0X1U, &tmp, 1, 1000);



	  T0_degC_x8_u16 = (((uint16_t)(tmp & 0x03)) << 8) | ((uint16_t)buffer[0]);
	  T1_degC_x8_u16 = (((uint16_t)(tmp & 0x0C)) << 6) | ((uint16_t)buffer[1]);
	  T0_degC = T0_degC_x8_u16 >> 3;
	  T1_degC = T1_degC_x8_u16 >> 3;

	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_T0_OUT_L | 0x80), buffer, 4);
	  //HTS221_T0_OUT_L: Address 0x3C
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	  HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0X20 | 0x80, 0X1U, buffer, 4, 1000);


	  T0_out = (((uint16_t)buffer[1]) << 8) | (uint16_t)buffer[0];
	  T1_out = (((uint16_t)buffer[3]) << 8) | (uint16_t)buffer[2];

	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_TEMP_OUT_L_REG | 0x80), buffer, 2);
	  //HTS221_TEMP_OUT_L_REG: Address 0x2A
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout)
	  HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0X2A | 0x80, 0X1U, buffer, 2, 1000);

	  T_out = (((uint16_t)buffer[1]) << 8) | (uint16_t)buffer[0];

